{
    "gr": {
        "title": "ΥΠΟΛΟΓΙΜΟΣ ΥΠΗΡΕΣΙΩΝ - ΒΑΡΔΙΩΝ",
        "description_header": "ΠΕΡΙΓΡΑΦΗ",
        "description_text": "Το παρόν εργαλείο αποσκοπέι στον ευκολότερο υπολογισμό των υπηρεσιών. Σχεδιάστηκε για μηνιαίο υπολογισμό, αλλά μπορεί να εκτελεστεί και με διαφορετικό αριθμό ημερών. Συνυπολογίζει την δίκαιη όσο είναι εφικτό κατανομή (και ανα μέρα αργίας).",
        "instructions_header": "ΟΔΗΓΙΕΣ",
        "instructions_text": "ΒΗΜΑ 1: Εισάγετε τον αριθμό των ατόμων και τον αριθμό των ημερών του μήνα που θέλετε να υπολογίσετε τις υπηρεσίες. ΒΗΜΑ 2: Πατήστε το κουμπί 'Generate New Table' για να δημιουργηθεί ο πίνακας. ΒΗΜΑ 3: Χαρακτηρίστε με κλικ στις ανάλογες ημερομηνίες τις αργίες του μήνα (γκρι χρώμα). Με δεύτερο κλικ στο ίδιο κουτάκι θα γίνει εκκαθάριση του κουτιού. ΒΗΜΑ 4: Συμπληρώστε τον πίνακα με τις υπηρεσίες των ατόμων. Με ένα κλικ (κόκκινο χρώμα) η μέρα θα χαρακτηριστεί ως μη διαθέσιμη για αυτό το άτομο. Με δεύτερο κλικ στο ίδιο κουτάκι θα οριστεί ως μέρα υπηρεσίας. Με τρίτο κλικ θα γίνει εκκαθάριση του κουτιού. ΒΗΜΑ 5: Πατήστε το κουμπί 'Autofill' για να συμπληρωθεί αυτόματα σύμφωνα με τις διαθέσιμες μέρες και τις μέγιστες δυνατές για τον καθένα. Μπορούν να γίνει έπειτα (ή πριν την αυτόματη συμπλήρωση) και χειροκίνητες αλλαγές-εισαγωγές. ΒΗΜΑ 6: Πατήστε το κουμπί 'Export to Excel' για να εξάγετε τον πίνακα σε αρχείο Excel στον υπολογιστή σας.",
        "about_header": "ΣΧΕΤΙΚΑ ΜΕ ΕΜΕΝΑ",
        "about_text": "Το παρόν εργαλείο αναπτύχθηκε για προσωπική χρήση όταν βρέθηκα αντιμέτωπος με το συγκεκριμένο καθήκον ανάθεσης των υπηρεσιών. Έαν σας φάνηκε όσο βοηθητικό ήταν και σε εμένα, μη διστάσετε να με ενημερώσετε στο pravitas.dev@gmail.com και να με υποστηρίξετε με ένα καφεδάκι ☕ στο https://paypal.me/hpravitas.",
        "button_generate": "Δημιουργία Νέου Πίνακα",
        "button_autofill": "Αυτόματη Συμπλήρωση Πίνακα",
        "button_clear": "Εκκαθάριση Πίνακα",
        "button_export": "Εξαγωγή σε Excel",
        "button_language": "English",
        "rows_label": "Εισαγωγή Ατόμων:",
        "cols_label": "Εισαγωγή Ημερών:"
    },
    "eng": {
        "title": "SHIFT CALCULATOR",
        "description_header": "DESCRIPTION",
        "description_text": "The present tool aims to facilitate the calculation of shifts. It was designed for monthly calculation but can also be executed with a different number of days. It takes into account fair distribution as far as possible (including holiday rotation).",
        "instructions_header": "INSTRUCTIONS",
        "instructions_text": "STEP 1: Enter the number of people and the number of days of the month you want to calculate shifts for. STEP 2: Click the 'Generate New Table' button to create the table. STEP 3: Mark the holidays of the month by clicking on the corresponding dates (gray color). Clicking again on the same box will clear it. STEP 4: Fill in the table with the shifts of the people. With one click (red color), the day will be marked as unavailable for that person. With a second click on the same box, it will be designated as a service day. Clicking a third time will clear the box. STEP 5: Click the 'Autofill' button to automatically fill it according to the available days and the maximum possible for each person. Manual changes/entries can be made before (or after) automatic filling. STEP 6: Click the 'Export to Excel' button to export the table to an Excel file on your computer.",
        "about_header": "ABOUT ME",
        "about_text": "This tool was developed for personal use when I was faced with the specific task of assigning shifts. If you found it as helpful as I did, don't hesitate to inform me at pravitas.dev@gmail.com and support me with a coffee ☕ at https://paypal.me/hpravitas.",
        "button_generate": "Generate New Table",
        "button_autofill": "Autofill Table",
        "button_clear": "Clear Table",
        "button_export": "Export to Excel",
        "button_language": "Ελληνικά",
        "rows_label": "Insert Number of People:",
        "cols_label": "Insert Number of Days:"
    }
}

